Merge branch 'patch-1' of https://github.com/3211133/StreamConverter into patch-1
